cmsis-svd/cmsis-svd/data/Infineon/s6e1c3xc.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "INTREQ" -->
    <peripheral>
      <name>INTREQ</name>
      <description>Interrupts</description>
      <version>3</version>
      <groupName>INTREQ</groupName>
      <baseAddress>0x40031000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x84</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "VIR_OFFSET" -->
        <register>
          <name>VIR_OFFSET</name>
          <description>Vector Indicate Register Offset Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "ODDPKS" -->
        <register>
          <name>ODDPKS</name>
          <description>USB ch.0 Odd Packet Size DMA Enable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ODDPKS4" -->
            <field>
              <name>ODDPKS4</name>
              <description>"If the transfer destination address of DMAC is USB.EP5DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS3" -->
            <field>
              <name>ODDPKS3</name>
              <description>"If the transfer destination address of DMAC is USB.EP4DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS2" -->
            <field>
              <name>ODDPKS2</name>
              <description>"If the transfer destination address of DMAC is USB.EP3DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS1" -->
            <field>
              <name>ODDPKS1</name>
              <description>"If the transfer destination address of DMAC is USB.EP2DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS0" -->
            <field>
              <name>ODDPKS0</name>
              <description>"If the transfer destination address of DMAC is USB.EP1DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EXC02MON" -->
        <register>
          <name>EXC02MON</name>
          <description>EXC02 Batch Read Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HWINT" -->
            <field>
              <name>HWINT</name>
              <description>Hardware watchdog timer interrupt request</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMI" -->
            <field>
              <name>NMI</name>
              <description>NMIX external pin interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ00MON" -->
        <register>
          <name>IRQ00MON</name>
          <description>IRQ00 Batch Read Register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ00</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ00</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ00</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ01MON" -->
        <register>
          <name>IRQ01MON</name>
          <description>IRQ01 Batch Read Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ01</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ01</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ01</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ02MON" -->
        <register>
          <name>IRQ02MON</name>
          <description>IRQ02 Batch Read Register</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ02</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ02</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ02</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
