cmsis-svd/cmsis-svd/data/Infineon/s6e1c3xc.svd
        <!-- REGISTER "EPFR16" -->
        <register>
          <name>EPFR16</name>
          <description>Extended Pin Function Setting Register 16</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK11B" -->
            <field>
              <name>SCK11B</name>
              <description>SCK11 Input/Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT11B" -->
            <field>
              <name>SOT11B</name>
              <description>SOT11 Input/Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN11S" -->
            <field>
              <name>SIN11S</name>
              <description>SIN11 Input Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK10B" -->
            <field>
              <name>SCK10B</name>
              <description>SCK10 Input/Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT10B" -->
            <field>
              <name>SOT10B</name>
              <description>SOT10 Input/Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN10S" -->
            <field>
              <name>SIN10S</name>
              <description>SIN10 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK9B" -->
            <field>
              <name>SCK9B</name>
              <description>SCK9 Input/Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT9B" -->
            <field>
              <name>SOT9B</name>
              <description>SOT9 Input/Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN9S" -->
            <field>
              <name>SIN9S</name>
              <description>SIN9 Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK8B" -->
            <field>
              <name>SCK8B</name>
              <description>SCK8 Input/Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT8B" -->
            <field>
              <name>SOT8B</name>
              <description>SOT8 Input/Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN8S" -->
            <field>
              <name>SIN8S</name>
              <description>SIN8 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR18" -->
        <register>
          <name>EPFR18</name>
          <description>Extended Pin Function Setting Register 18</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CECR1B" -->
            <field>
              <name>CECR1B</name>
              <description>CEC1 input/output selection bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CECR0B" -->
            <field>
              <name>CECR0B</name>
              <description>CEC0 input/output selection bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR22" -->
        <register>
          <name>EPFR22</name>
          <description>Extended Pin Function Setting Register 22</description>
          <addressOffset>0x658</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000F0F0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCS31E" -->
            <field>
              <name>SCS31E</name>
              <description>SCS31 Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS30B" -->
            <field>
              <name>SCS30B</name>
              <description>SCS30 Input/Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS11E" -->
            <field>
              <name>SCS11E</name>
              <description>SCS11 Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS10B" -->
            <field>
              <name>SCS10B</name>
              <description>SCS10 Input/Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR23" -->
        <register>
          <name>EPFR23</name>
          <description>Extended Pin Function Setting Register 23</description>
          <addressOffset>0x65C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCS73E" -->
            <field>
              <name>SCS73E</name>
              <description>SCS73 Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS72E" -->
            <field>
              <name>SCS72E</name>
              <description>SCS72 Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS71E" -->
            <field>
              <name>SCS71E</name>
              <description>SCS71 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS70E" -->
            <field>
              <name>SCS70E</name>
              <description>SCS70 Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS63E" -->
            <field>
              <name>SCS63E</name>
              <description>SCS63 Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS62E" -->
            <field>
              <name>SCS62E</name>
              <description>SCS62 Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS61E" -->
            <field>
              <name>SCS61E</name>
              <description>SCS61 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS60E" -->
            <field>
              <name>SCS60E</name>
              <description>SCS60 Output Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR31" -->
        <register>
          <name>EPFR31</name>
          <description>Extended Pin Function Setting Register 31</description>
          <addressOffset>0x67C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SI2CSDA6B" -->
            <field>
              <name>SI2CSDA6B</name>
              <description>I2C Slave ch.6 SDA pin select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SI2CSCL6B" -->
            <field>
              <name>SI2CSCL6B</name>
              <description>I2C Slave ch.6 SCL pin select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR33" -->
        <register>
          <name>EPFR33</name>
          <description>Extended Pin Function Setting Register 33</description>
          <addressOffset>0x684</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLK1E" -->
            <field>
              <name>CLK1E</name>
              <description>CLK1 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VCC1E" -->
            <field>
              <name>VCC1E</name>
              <description>VCC1 Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPEN1E" -->
            <field>
              <name>VPEN1E</name>
              <description>VPEN1 Output Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RST1E" -->
            <field>
              <name>RST1E</name>
              <description>PST1 Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA1B" -->
            <field>
              <name>DATA1B</name>
              <description>DATA1 Bus Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIN1S" -->
            <field>
              <name>CIN1S</name>
              <description>CIN1 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLK0E" -->
            <field>
              <name>CLK0E</name>
              <description>CLK0 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VCC0E" -->
            <field>
              <name>VCC0E</name>
              <description>VCC0 Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPEN0E" -->
            <field>
              <name>VPEN0E</name>
              <description>VPEN0 Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RST0E" -->
            <field>
              <name>RST0E</name>
              <description>RST0 Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA0B" -->
            <field>
              <name>DATA0B</name>
              <description>DATA0 Bus Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIN0S" -->
            <field>
              <name>CIN0S</name>
              <description>CIN0 Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR34" -->
        <register>
          <name>EPFR34</name>
          <description>Extended Pin Function Setting Register 34</description>
          <addressOffset>0x688</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000F0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CTS1S" -->
            <field>
              <name>CTS1S</name>
              <description>CTS1 Input Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTS1E" -->
            <field>
              <name>RTS1E</name>
              <description>RTS1 Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
