cmsis-svd/cmsis-svd/data/Infineon/s6e1c3xc.svd
        <!-- REGISTER "BUR07" -->
        <register>
          <name>BUR07</name>
          <description>Backup Register 07</description>
          <addressOffset>0x806</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR08" -->
        <register>
          <name>BUR08</name>
          <description>Backup Register 08</description>
          <addressOffset>0x807</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR09" -->
        <register>
          <name>BUR09</name>
          <description>Backup Register 09</description>
          <addressOffset>0x808</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR10" -->
        <register>
          <name>BUR10</name>
          <description>Backup Register 10</description>
          <addressOffset>0x809</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR11" -->
        <register>
          <name>BUR11</name>
          <description>Backup Register 11</description>
          <addressOffset>0x80A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR12" -->
        <register>
          <name>BUR12</name>
          <description>Backup Register 12</description>
          <addressOffset>0x80B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR13" -->
        <register>
          <name>BUR13</name>
          <description>Backup Register 13</description>
          <addressOffset>0x80C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR14" -->
        <register>
          <name>BUR14</name>
          <description>Backup Register 14</description>
          <addressOffset>0x80D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR15" -->
        <register>
          <name>BUR15</name>
          <description>Backup Register 15</description>
          <addressOffset>0x80E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR16" -->
        <register>
          <name>BUR16</name>
          <description>Backup Register 16</description>
          <addressOffset>0x80F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "WIOLC_CTL" -->
        <register>
          <name>WIOLC_CTL</name>
          <description>IO State hold control Register</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x00010101</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LHX_ST" -->
            <field>
              <name>LHX_ST</name>
              <description>IO state bit</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CONTX" -->
            <field>
              <name>CONTX</name>
              <description>IO State hold function enable bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LH_CL" -->
            <field>
              <name>LH_CL</name>
              <description>IO State hold release bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SUBOSC_CTL" -->
        <register>
          <name>SUBOSC_CTL</name>
          <description>Sub Oscillator IO Control Register</description>
          <addressOffset>0x904</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SUBXC" -->
            <field>
              <name>SUBXC</name>
              <description>Sub Clock (Oscillation) Pin Setting Register</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CEC_CTL" -->
        <register>
          <name>CEC_CTL</name>
          <description>CEC Input/Output Control Register</description>
          <addressOffset>0x908</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WS_CECR1B" -->
            <field>
              <name>WS_CECR1B</name>
              <description>CEC1 input/output selection bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WS_CECR0B" -->
            <field>
              <name>WS_CECR0B</name>
              <description>CEC0 input/output selection bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DEBUG_SW_CTL" -->
        <register>
          <name>DEBUG_SW_CTL</name>
          <description>Serial Wire Debug Control Register</description>
          <addressOffset>0x90C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DBG_EN" -->
            <field>
              <name>DBG_EN</name>
              <description>SWD enable bits</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
