cmsis-svd/cmsis-svd/data/Infineon/s6e1c3xc.svd
        <!-- REGISTER "IBSADR" -->
        <register>
          <name>IBSADR</name>
          <description>I2C Bus 7-bit Slave Address Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SAEN" -->
            <field>
              <name>SAEN</name>
              <description>Slave Address Enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SA" -->
            <field>
              <name>SA</name>
              <description>Slave Address Value bit</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IBSMSKR" -->
        <register>
          <name>IBSMSKR</name>
          <description>I2C Bus 7-bit Slave Address Mask Register</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EN" -->
            <field>
              <name>EN</name>
              <description>Operating Enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SM" -->
            <field>
              <name>SM</name>
              <description>Slave Address Mask bit</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IBSDSTUPR" -->
        <register>
          <name>IBSDSTUPR</name>
          <description>I2C Bus Slave Data Setup Register</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SETUP" -->
            <field>
              <name>SETUP</name>
              <description>Setup bits</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IBSTDR" -->
        <register>
          <name>IBSTDR</name>
          <description>I2C Bus Slave Transmission Data Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TDR" -->
            <field>
              <name>TDR</name>
              <description>Transmission Data bits</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IBSRDR" -->
        <register>
          <name>IBSRDR</name>
          <description>I2C Bus Slave Reception Data Register</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RDR" -->
            <field>
              <name>RDR</name>
              <description>Reception Data bis</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IBSSCR" -->
        <register>
          <name>IBSSCR</name>
          <description>I2C Bus Slave Status Clear Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0406</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTC" -->
            <field>
              <name>INTC</name>
              <description>Status Interrupt Request Flag Clear bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RSCC" -->
            <field>
              <name>RSCC</name>
              <description>Re-Start Condition Detection Flag Clear bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SPCC" -->
            <field>
              <name>SPCC</name>
              <description>Stop Condition Detection Flag Clear bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IBSSSR" -->
        <register>
          <name>IBSSSR</name>
          <description>I2C Bus Slave Status Set Register</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0100</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TDRES" -->
            <field>
              <name>TDRES</name>
              <description>Transmission Data Empty Flag Set bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
