cmsis-svd/cmsis-svd/data/Infineon/s6e1c3xc.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFSI2S0" -->
    <peripheral>
      <name>MFSI2S0</name>
      <description>I2S0 Registers</description>
      <version>A</version>
      <groupName>MFSI2S</groupName>
      <baseAddress>0x4003CA00</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x9</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CNTLREG" -->
        <register>
          <name>CNTLREG</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0x0779</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "I2SRUN" -->
            <field>
              <name>I2SRUN</name>
              <description>I2S clock generate enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSKB" -->
            <field>
              <name>MSKB</name>
              <description>Mask bit output bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CKOE" -->
            <field>
              <name>CKOE</name>
              <description>I2SCK and I2SWS output enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SEN" -->
            <field>
              <name>I2SEN</name>
              <description>I2S mode enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSPL" -->
            <field>
              <name>FSPL</name>
              <description>I2SWS polarity set bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SMOD" -->
            <field>
              <name>I2SMOD</name>
              <description>I2S mode select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRAML" -->
            <field>
              <name>FRAML</name>
              <description>Frame length select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2SCLK" -->
        <register>
          <name>I2SCLK</name>
          <description>I2S Clock Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC0FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MCKIE" -->
            <field>
              <name>MCKIE</name>
              <description>Main clock input enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCKOE" -->
            <field>
              <name>MCKOE</name>
              <description>Main clock output enable bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SDIV" -->
            <field>
              <name>I2SDIV</name>
              <description>I2S clock division set bit</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2SRST" -->
        <register>
          <name>I2SRST</name>
          <description>I2S Reset Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "I2SRST" -->
            <field>
              <name>I2SRST</name>
              <description>I2S software reset bit</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2SST" -->
        <register>
          <name>I2SST</name>
          <description>I2S Status Register</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Bus busy indication for transmit bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CKSTP" -->
            <field>
              <name>CKSTP</name>
              <description>Clock stop indication bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
